"""
Замыкание для проверки времени выполнения. Напишите функцию create_time_checker(max_time),
которая возвращает вложенную функцию для проверки времени выполнения теста.
Вложенная функция принимает фактическое время выполнения и сообщает,
превышен установленный лимит или нет. Создайте два независимых замыкания
с разными значениями max_time и продемонстрируйте их работу.
"""


def create_time_checker(max_time):
    def time_checker(time):
        return time < max_time

    return time_checker


if __name__ == '__main__':
    foo = create_time_checker(5)
    print(f"лимит не привышен" if foo(3) else "лимит привышен")
    print(f"лимит не привышен" if foo(7) else "лимит привышен")
